<?php

namespace App\Modules;

use App\Models\Categories;
use App\Models\CategoryProduct;
use App\Models\Groups;
use App\Models\Products;
use Illuminate\Support\Arr;
use Illuminate\Support\Collection;
use phpDocumentor\Reflection\Types\This;

class Beautify
{
    static function setThubm ($color): ?string
    {
        $color = mb_strtolower($color);

        $colors = [
            'антрацитовый'          => ['bg'=>'#464451', 'color'=>'#b5b0b9'],
            'бежево-серый'          => ['bg'=>'#6d6552', 'color'=>'#eddbb2'],
            'бежевый'               => ['bg'=>'#f5f5dc', 'color'=>'#75756a'],
            'белый'                 => ['bg'=>'#ffffff', 'color'=>'#808080'],
            'белый/красный'         => ['bg'=>'linear-gradient(138deg, rgba(255,0,0,1) 0%, rgba(255,255,255,1) 26%, rgba(255,81,81,1) 49%, rgba(255,255,255,1) 72%, rgba(255,0,0,1) 96%)', 'color'=>'#191919'],
            'бирюзовый'             => ['bg'=>'#30d5c8', 'color'=>'#145751'],
            'бордовый'              => ['bg'=>'#9b2d30', 'color'=>'#f1f1f1'],
            'бронзово-коричневый'   => ['bg'=>'linear-gradient(120deg, rgba(205,127,50,1) 50%, rgba(150,75,0,1) 50%);', 'color'=>'#ffffff'],
            'бронзовый'             => ['bg'=>'#cd7f32', 'color'=>'#ffffff'],
            'голубой'               => ['bg'=>'#42aaff', 'color'=>'#215580'],
            'горчичный'             => ['bg'=>'#ffdb58', 'color'=>'#806e2d'],
            'дымчатый'              => ['bg'=>'#c4c4bc', 'color'=>'#191919'],
            'желтый'                => ['bg'=>'#ffff00', 'color'=>'#808000'],
            'желтый металлик'       => ['bg'=>'radial-gradient(circle, rgba(255,255,0,1) 0%, rgba(201,148,0,1) 100%)', 'color'=>'#191919'],
            'жемчужный'             => ['bg'=>'radial-gradient(circle, rgba(255,255,255,1) 0%, rgba(255,243,243,1) 100%)', 'color'=>'#191919'],
            'зеленый'               => ['bg'=>'#008000', 'color'=>'#00ff00'],
            'зеленый неон'          => ['bg'=>'radial-gradient(circle, rgba(52,221,20,1) 0%, rgba(164,255,0,1) 100%)', 'color'=>'#191919'],
            'змеиный'               => ['bg'=>'radial-gradient(circle, rgba(75,122,66,1) 0%, rgba(128,184,28,1) 100%)', 'color'=>'#ffffff'],
            'золотистый'            => ['bg'=>'', 'color'=>''],
            'золотой'               => ['bg'=>'radial-gradient(circle, rgba(255,215,0,1) 0%, rgba(246,184,90,1) 100%)', 'color'=>'#191919'],
            'каштановый'            => ['bg'=>'#CD5C5C', 'color'=>'#ffffff'],
            'комбинированный'       => ['bg'=>'linear-gradient(138deg, rgba(255,0,0,1) 0%, rgba(246,179,90,1) 16%, rgba(235,246,90,1) 34%, rgba(96,246,90,1) 52%, rgba(84,236,251,1) 67%, rgba(90,117,246,1) 84%, rgba(246,90,203,1) 100%)', 'color'=>'#191919'],
            'коралловый'            => ['bg'=>'#ff7f50', 'color'=>'#803f28'],
            'коричневый'            => ['bg'=>'#964b00', 'color'=>'#170b00'],
            'кофейный'              => ['bg'=>'#442d25', 'color'=>'#c4816a'],
            'красно-коричневый'     => ['bg'=>'#592321', 'color'=>'#d95550'],
            'красный'               => ['bg'=>'#ff2e2e', 'color'=>'#ffffff'],
            'кремовый'              => ['bg'=>'#fdf4e3', 'color'=>'#7d7970'],
            'крокодиловый'          => ['bg'=>'#736d58', 'color'=>'#ffffff'],
            'лайм'                  => ['bg'=>'#00ff00', 'color'=>'#ffffff'],
            'лиловый'               => ['bg'=>'#db7093', 'color'=>'#ffffff'],
            'лакированный'          => ['bg'=>'linear-gradient(138deg, rgba(47,47,47,1) 0%, rgba(255,255,255,1) 50%, rgba(68,68,68,1) 98%)', 'color'=>'#191919'],
            'матовый'               => ['bg'=>'linear-gradient(138deg, rgba(255,255,255,1) 0%, rgba(68,68,68,1) 100%)', 'color'=>'#191919'],
            'махагон'               => ['bg'=>'#4c2f27', 'color'=>'#ffffff'],
            'медный'                => ['bg'=>'#b87333', 'color'=>'#382310'],
            'металлик'              => ['bg'=>'linear-gradient(138deg, rgba(255,255,255,1) 31%, rgba(68,68,68,1) 100%)', 'color'=>'#191919'],
            'миндальный'            => ['bg'=>'#efdecd', 'color'=>'#191919'],
            'молочный'              => ['bg'=>'#fff6d4', 'color'=>'#191919'],
            'мятный'                => ['bg'=>'#3eb489', 'color'=>'#123629'],
            'небесно-голубой'       => ['bg'=>'#75bbfd', 'color'=>'#191919'],
            'огненно-красный'       => ['bg'=>'#af2b1e', 'color'=>'#000000'],
            'оливковый'             => ['bg'=>'#808000', 'color'=>'#ffff00'],
            'оранжевый'             => ['bg'=>'#ffa500', 'color'=>'#805300'],
            'ореховый'              => ['bg'=>'#3e2b23', 'color'=>'#ffffff'],
            'перламутровый'         => ['bg'=>'radial-gradient(circle, rgb(255 232 232) 0%, rgba(255,236,236,1) 100%);', 'color'=>'#191919'],
            'персик'                => ['bg'=>'#ffd8b1', 'color'=>'#191919'],
            'песочный'              => ['bg'=>'#fcdd76', 'color'=>'#7d6d3b'],
            'пудровый'              => ['bg'=>'#ffb2d0', 'color'=>'#191919'],
            'разноцветный'          => ['bg'=>'linear-gradient(138deg, rgba(255,0,0,1) 0%, rgba(246,179,90,1) 16%, rgba(235,246,90,1) 34%, rgba(96,246,90,1) 52%, rgba(84,236,251,1) 67%, rgba(90,117,246,1) 84%, rgba(246,90,203,1) 100%)', 'color'=>'#191919'],
            'розовато-лиловый'      => ['bg'=>'#993366', 'color'=>'#ffffff'],
            'розовый'               => ['bg'=>'#ffc0cb', 'color'=>'#806065'],
            'рыжий'                 => ['bg'=>'#d77d31', 'color'=>'#573214'],
            'салатовый'             => ['bg'=>'#99ff99', 'color'=>'#4d804d'],
            'светло-бежевый'        => ['bg'=>'#fffeb6', 'color'=>'#191919'],
            'светло-голубой'        => ['bg'=>'#87cefa', 'color'=>'#42657a'],
            'светло-золотой'        => ['bg'=>'#ffd700', 'color'=>'#191919'],
            'светло-коричневый'     => ['bg'=>'#987654', 'color'=>'#1a140e'],
            'светло-розовый'        => ['bg'=>'#ffb6c1', 'color'=>'#805b60'],
            'светло-рубиновый'      => ['bg'=>'#ca0147', 'color'=>'#ffffff'],
            'светло-серый'          => ['bg'=>'#bbbbbb', 'color'=>'#3b3b3b'],
            'светло-синий'          => ['bg'=>'#a6caf0', 'color'=>'#4d5e70'],
            'серебристый'           => ['bg'=>'#c5c9c7', 'color'=>'#191919'],
            'серебряный'            => ['bg'=>'#c0c0c0', 'color'=>'#404040'],
            'серо-голубой'          => ['bg'=>'#77a1b5', 'color'=>'#191919'],
            'серо-коричневый'       => ['bg'=>'#403a3a', 'color'=>'#bfaeae'],
            'серый'                 => ['bg'=>'#808080', 'color'=>'#ffffff'],
            'серый металлик'        => ['bg'=>'radial-gradient(circle, rgba(128,128,128,1) 0%, rgba(238,238,238,1) 100%)', 'color'=>'#191919'],
            'сине-коричневый'       => ['bg'=>'radial-gradient(circle, rgba(0,35,255,1) 0%, rgba(190,67,0,1) 100%)', 'color'=>'#ffffff'],
            'синий'                 => ['bg'=>'#0000ff', 'color'=>'#ffffff'],
            'синяя замша'           => ['bg'=>'radial-gradient(circle, rgba(30,43,122,1) 0%, rgba(33,33,88,1) 100%)', 'color'=>'#ffffff'],
            'сиреневый'             => ['bg'=>'#c8a2c8', 'color'=>'#473a47'],
            'темная бронза'         => ['bg'=>'#cd7f32', 'color'=>'#ffffff'],
            'темно-бежевый'         => ['bg'=>'#ac9362', 'color'=>'#ffffff'],
            'темно-бордовый'        => ['bg'=>'#800002', 'color'=>'#ffffff'],
            'темно-зеленый'         => ['bg'=>'#013220', 'color'=>'#04b372'],
            'темно-коричневый'      => ['bg'=>'#654321', 'color'=>'#e6994c'],
            'темно-оливковый'       => ['bg'=>'#556832', 'color'=>'#bee86f'],
            'темно-серый'           => ['bg'=>'#49423d', 'color'=>'#c9b7a9'],
            'тёмно-синий'           => ['bg'=>'#002137', 'color'=>'#80ccff'],
            'фиолетовый'            => ['bg'=>'#8b00ff', 'color'=>'#ffffff'],
            'фисташковый'           => ['bg'=>'#bef574', 'color'=>'#5a7537'],
            'хаки'                  => ['bg'=>'#806b2a', 'color'=>'#ffd454'],
            'черный'                => ['bg'=>'#000000', 'color'=>'#ffffff'],
            'шампань'               => ['bg'=>'#fcfcee', 'color'=>'#7d7d75'],
            'шафран'                => ['bg'=>'#f4d03f', 'color'=>'#191919'],
            'шафрановый'            => ['bg'=>'#f4d03f', 'color'=>'#191919'],
            'экрю'                  => ['bg'=>'#cdb891', 'color'=>'#4d4536'],
        ];
        if (isset($colors[$color]))
            return '<div class="filter-thumb" style="background:'. $colors[$color]['bg'] . '; color:'. $colors[$color]['color'].';"></div>';

        return null;
    }
}
